Catalogs/АссортиментБлюд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>АссортиментБлюд</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КатегорияБлюда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорияБлюд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесГотовогоБлюда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Калорийность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АссортиментБлюд/Ext/ManagerModule.bsl
Процедура СоздатьБлюдо(Блюдо, КатегорияБлюда, ВесГотовогоБлюда, Состав, Калорийность, Цена) Экспорт   
	 
	 НовоеБлюдо = СоздатьЭлемент();
	 НовоеБлюдо.Наименование = Блюдо;
	 НовоеБлюдо.КатегорияБлюда = КатегорияБлюда;
	 НовоеБлюдо.ВесГотовогоБлюда = ВесГотовогоБлюда;
	 НовоеБлюдо.Состав = Состав;
	 НовоеБлюдо.Калорийность = Калорийность;
	 НовоеБлюдо.Цена = Цена;
     НовоеБлюдо.Записать();
	 
 КонецПроцедуры
 
 Процедура Печать(ТабДок, Ссылка) Экспорт
	 
	 Макет = Справочники.АссортиментБлюд.ПолучитьМакет("Печать");
	 
	 ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	 ОбластьМенюШапка = Макет.ПолучитьОбласть("МенюШапка");
	 ОбластьМеню = Макет.ПолучитьОбласть("Меню");
	 
	 ТабДок.Очистить();
	 ТабДок.Вывести(ОбластьЗаголовок);
	 
	 ВыводШапка = Ложь;      
	 Для каждого Строка Из Перечисления.КатегорияБлюд Цикл 
		 
		 Выборка = Справочники.АссортиментБлюд.Выбрать();
		 
		 Пока Выборка.Следующий() Цикл   
			 
			 Если Выборка.КатегорияБлюда = Строка Тогда
				 
				 Если Не ВыводШапка Тогда      //выводим шапку, если еще не вывели
					 
					 ОбластьМенюШапка.Параметры.КатегорияБлюда = Строка;
					 ТабДок.Вывести(ОбластьМенюШапка); 
					 ВыводШапка = Истина;
				 КонецЕсли; 
				 
				 ОбластьМеню.Параметры.Заполнить(Выборка);			
				 ОбластьМеню.Параметры.Блюдо =  Выборка.Наименование;				 
				 ТабДок.Вывести(ОбластьМеню);
				 
			 КонецЕсли;
			 
		 КонецЦикла; 
		 
		 ВыводШапка = Ложь; 
	 КонецЦикла; 
	 
 КонецПроцедуры
